In [46]:
import pandas as pd

In [47]:
dataframe1 = pd.DataFrame([[11,2,3],[22,4,5]])

In [48]:
dataframe1.columns = ["T1","T2","T3"]

In [49]:
dataframe1

   T1  T2  T3
0  11   2   3
1  22   4   5

In [50]:
dataframe2 = pd.DataFrame([[11,4,4],[11,3,6],[11,3,6],[22,4,5],[22,42,51]])
dataframe2.columns = ["T1","P3","P6"]

In [51]:
dataframe2

   T1  P3  P6
0  11   4   4
1  11   3   6
2  11   3   6
3  22   4   5
4  22  42  51

In [52]:
dataframe1

   T1  T2  T3
0  11   2   3
1  22   4   5

In [56]:
tf = dataframe2.groupby(['T1'])["P3"].sum()

In [59]:
tf.reset_index()

   T1  P3
0  11  10
1  22  46

In [60]:
tf

T1
11    10
22    46
Name: P3, dtype: int64